&НаКлиенте
Процедура СписокУслугУслугаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокУслуг.ТекущиеДанные;
	ПоследняяЦена = ПолучитьПоследнююЦенуУслуги(ТекущаяСтрока.Услуга);
	Если ПоследняяЦена > 0 Тогда
		ТекущаяСтрока.Цена = ПоследняяЦена;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Количество) Тогда
			РассчётСуммыУслуг();
		КонецЕсли;
	Иначе
		Сообщить("Не удалось найти запись в регистре цен для этой услуги. Проведение будет невозможно.");
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ПолучитьПоследнююЦенуУслуги(Услуга)
	Отбор = Новый Структура("Услуга", Услуга);
	ПоследняяЗапись = РегистрыСведений.ЦеныУслуг.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	
	Если ПоследняяЗапись = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат ПоследняяЗапись.Цена;
КонецФункции

&НаКлиенте
Процедура СписокУслугКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокУслуг.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.Цена) Тогда
		РассчётСуммыУслуг();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчётСуммыУслуг()
	ТекущаяСтрока = Элементы.СписокУслуг.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура РассчётСуммыЗапчастей()
	ТекущаяСтрока = Элементы.СписокЗапчастей.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗапчастейЗапчастьПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокЗапчастей.ТекущиеДанные; 
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Запчасть) Тогда
		Возврат;
	КонецЕсли;
	
	ПоследняяЦена = ПолучитьПоследнююЦенуЗапчасти(ТекущаяСтрока.Запчасть);
	Если ПоследняяЦена > 0 Тогда
		ТекущаяСтрока.Цена = ПоследняяЦена;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Количество) Тогда
			КоличествоЗапчастей = ПолучитьКоличествоЗапчасти(ТекущаяСтрока.Запчасть);
			
			Если КоличествоЗапчастей < ТекущаяСтрока.Количество Тогда
				Сообщить("На складе недостаточно запчастей. Проведение невозможно.");
			КонецЕсли; 
			
			РассчётСуммыЗапчастей();
		КонецЕсли;
	Иначе
		Сообщить("Не удалось найти запись в регистре цен для этой запчасти. Проведение будет невозможно.")
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ПолучитьПоследнююЦенуЗапчасти(Запчасть)
	Отбор = Новый Структура("Запчасть", Запчасть);
	ПоследняяЗапись = РегистрыСведений.ЦеныЗапчастей.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	
	Если ПоследняяЗапись = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат ПоследняяЗапись.ПродажнаяЦена;
КонецФункции

&НаСервере
Функция ПолучитьКоличествоЗапчасти(Запчасть)
	Отбор = Новый Структура("Запчасть", Запчасть);  
	Результат = РегистрыНакопления.ОстаткиЗапчастей.Остатки(ТекущаяДата(), Отбор);
	
	Если Результат.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Результат[0].Количество;
КонецФункции

&НаКлиенте
Процедура СписокЗапчастейКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокЗапчастей.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.Запчасть) Тогда
		КоличествоЗапчастей = ПолучитьКоличествоЗапчасти(ТекущаяСтрока.Запчасть);
		Если КоличествоЗапчастей < ТекущаяСтрока.Количество Тогда
			Сообщить("На складе недостаточно запчастей. Проведение невозможно.");
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущаяСтрока.Цена) Тогда
		РассчётСуммыЗапчастей();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПользовательМастер() Тогда
		Объект.Мастер = ПолучитьТекущегоМастера();
		Элементы.Мастер.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущегоМастера()
	Возврат Справочники.Сотрудники.НайтиПоРеквизиту("Email", 
	ПользователиИнформационнойБазы.ТекущийПользователь().АдресЭлектроннойПочты);
КонецФункции

&НаСервере
функция ПользовательМастер()
	Возврат РольДоступна("Мастер") И НЕ РольДоступна("ПолныеПрава");
КонецФункции

&НаКлиенте
Процедура МастерПриИзменении(Элемент)
	Заявка = Неопределено;
КонецПроцедуры
