
Процедура ПередЗаписьюСтатусыЗаявокПередЗаписью(Источник, Отказ, Замещение) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	СтатусыЗаявок.Статус КАК Статус,
	|	СтатусыЗаявок.Заявка.Ссылка КАК Заявка
	|ИЗ РегистрСведений.СтатусыЗаявок.СрезПоследних(&Дата) КАК СтатусыЗаявок";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	ПоследниеСтатусы = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоследниеСтатусы.Вставить(Выборка.Заявка, Выборка.Статус);
	КонецЦикла;

	Для Каждого Запись из Источник Цикл
		ПоследнийСтатус = ПоследниеСтатусы.Получить(Запись.Заявка.Ссылка);
		Если ПоследнийСтатус = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если Запись.Статус <> ПоследнийСтатус Тогда
			Если ПоследнийСтатус = Перечисления.СтатусыЗаявок.Готова
				ИЛИ ПоследнийСтатус = Перечисления.СтатусыЗаявок.Выдана
				ИЛИ ПоследнийСтатус = Перечисления.СтатусыЗаявок.Отказ Тогда
				Сообщить("Статус заявки не может быть изменён - заявка завершена");
				Отказ = Истина;
			ИначеЕсли Перечисления.СтатусыЗаявок.Индекс(Запись.Статус) 
				< Перечисления.СтатусыЗаявок.Индекс(ПоследнийСтатус) Тогда
				Сообщить("Статус заявки не может быть изменён на более раний");
				Отказ = Истина; 
			КонецЕсли;
		КонецЕсли
	КонецЦикла;
КонецПроцедуры
