Процедура ПроверкаКорректностиПочты(Отказ, Email) Экспорт
	Если ЗначениеЗаполнено(СокрП(СокрЛП(Email)))
		И НЕ СтрПодобнаПоРегулярномуВыражению(Email, "^\w+@\w+\.\w+$") Тогда
		Сообщить("Введённый Email некорректен");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверкаУникальностиПочты(Отказ, Email, Справочник, Ссылка) Экспорт
	Если НЕ УникальностьПолейСправочников.ПолеУникально("Клиенты", "Email", Email, Ссылка) 
		И ЗначениеЗаполнено(Email) Тогда
		Сообщить("Клиент с таким Email уже существует");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры