
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна("Мастер") И НЕ РольДоступна("ПолныеПрава") Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Мастер.Email");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ПользователиИнформационнойБазы.ТекущийПользователь().АдресЭлектроннойПочты;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
КонецПроцедуры
