
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиЗапчастей Расход
	Движения.ОстаткиЗапчастей.Записывать = Истина;
	Для Каждого ТекСтрокаСписокЗапчастей Из СписокЗапчастей Цикл
		Движение = Движения.ОстаткиЗапчастей.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Запчасть = ТекСтрокаСписокЗапчастей.Запчасть;
		Движение.Количество = ТекСтрокаСписокЗапчастей.Количество;
	КонецЦикла;

	// регистр Выручка 
	Движения.Выручка.Записывать = Истина;
	Для Каждого ТекСтрокаСписокУслуг Из СписокУслуг Цикл
		Движение = Движения.Выручка.Добавить();
		Движение.Период = Дата;
		Движение.Услуга = ТекСтрокаСписокУслуг.Услуга;
		Движение.Количество = ТекСтрокаСписокУслуг.Количество;
		Движение.Сумма = ТекСтрокаСписокУслуг.Сумма;
	КонецЦикла;

	// регистр ВзаимоРасчёты Приход
	Движения.ВзаимоРасчёты.Записывать = Истина;
	Для Каждого ТекСтрокаСписокУслуг Из СписокУслуг Цикл
		Движение = Движения.ВзаимоРасчёты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = Заявка.Клиент;
		Движение.Сумма = ТекСтрокаСписокУслуг.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	Если НЕ ЗначениеЗаполнено(Мастер) Тогда
		Сообщить("Заполните поле 'Мастер'");
		Отказ = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 СтатусыЗаявок.Статус КАК Статус
	|ИЗ РегистрСведений.СтатусыЗаявок КАК СтатусыЗаявок
	|ГДЕ СтатусыЗаявок.Заявка = &Ссылка
	|УПОРЯДОЧИТЬ ПО СтатусыЗаявок.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", Заявка.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПоследнийСтатус = Выборка.Статус;
	Иначе
		Сообщить("Ошибка получения статуса заявки. Убедитесь, что у заявки есть запись в регистре сведений 'СтатусыЗаявок'");
		Отказ = Истина;
	КонецЕсли;
	
	Если ПоследнийСтатус = Перечисления.СтатусыЗаявок.Отказ
		ИЛИ ПоследнийСтатус = Перечисления.СтатусыЗаявок.Выдана
		ИЛИ ПоследнийСтатус = Перечисления.СтатусыЗаявок.Готова Тогда
		Сообщить("Невозможно вести ход работ - заявка завершена");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

