
Процедура ПроведениеПоступлениеЗапчастейОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ЦеныЗапчастей.Запчасть.Ссылка КАК Запчасть
	|ИЗ РегистрСведений.ЦеныЗапчастей.СрезПоследних(&Дата) КАК ЦеныЗапчастей";
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПоследниеЦены = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		ПоследниеЦены.Вставить(Выборка.Запчасть, Выборка.Запчасть);
	КонецЦикла;
	
	Для Каждого Запись Из Источник.СписокЗапчастей Цикл
		Если ПоследниеЦены.Получить(Запись.Запчасть.Ссылка) = Неопределено
			ИЛИ НЕ ЗначениеЗаполнено(Запись.Цена) Тогда
			Сообщить("Ошибка проведения. Убедитесь, что для всех запчастей есть запись в регистре сведений. " + 
			"Если вы уверены, что запись есть, попробуйте заново выбрать запчасть.");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
