
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиЗапчастей Приход
	Движения.ОстаткиЗапчастей.Записывать = Истина;
	Для Каждого ТекСтрокаСписокЗапчастей Из СписокЗапчастей Цикл
		Движение = Движения.ОстаткиЗапчастей.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Запчасть = ТекСтрокаСписокЗапчастей.Запчасть;
		Движение.Количество = ТекСтрокаСписокЗапчастей.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
