
Процедура ПередЗаписьюВыполненияРаботПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ВыполнениеРабот.ТипРаботы
	|ИЗ Документ.ВыполнениеРабот КАК ВыполнениеРабот
	|ГДЕ ВыполнениеРабот.Заявка = &Заявка
	|УПОРЯДОЧИТЬ ПО ВыполнениеРабот.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Заявка", Источник.Заявка.Ссылка);
	
	ПоследнийТипРаботы = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПоследнийТипРаботы = Выборка.ТипРаботы;
	КонецЕсли;
	
	Если ПоследнийТипРаботы = Неопределено 
		ИЛИ ПоследнийТипРаботы <> Источник.ТипРаботы Тогда
		Если Источник.ТипРаботы = Перечисления.ТипыРабот.Диагностика Тогда
			ЗаписатьВРегистр(Перечисления.СтатусыЗаявок.ВДиагностике, Источник.Заявка.Ссылка);
		ИначеЕсли Источник.ТипРаботы = Перечисления.ТипыРабот.Ремонт Тогда
			ЗаписатьВРегистр(Перечисления.СтатусыЗаявок.ВРемонте, Источник.Заявка.Ссылка);
		ИначеЕсли Источник.ТипРаботы = Перечисления.ТипыРабот.Завершение Тогда
			ЗаписатьВРегистр(Перечисления.СтатусыЗаявок.Готова, Источник.Заявка.Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ЗаписатьВРегистр(Статус, Ссылка)
	МенеджерЗаписи = РегистрыСведений.СтатусыЗаявок.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заявка = Ссылка;
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Заявка = Ссылка;
	МенеджерЗаписи.Записать();
КонецФункции

Процедура ПроведениеВыполнениеРаботОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	ПоследниеЦеныУслуг = ПолучитьПоследниеЦеныУслуг();
	ПроверкаЦенУслуг(Источник.СписокУслуг, Отказ, ПоследниеЦеныУслуг);
	
	ПоследниеЦеныЗапчастей = ПолучитьПоследниеЦеныЗапчастей();
	ПроверкаЦенЗапчастей(Источник.СписокЗапчастей, Отказ, ПоследниеЦеныЗапчастей);
	
	КоличествоЗапчастей = ПолучитьКоличествоЗапчастей();
	ПроверкаКоличестваЗапчастей(Источник.СписокЗапчастей, Отказ, КоличествоЗапчастей);
КонецПроцедуры 

Функция ПолучитьПоследниеЦеныУслуг()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ЦеныУслуг.Услуга.Ссылка КАК Услуга
	|ИЗ РегистрСведений.ЦеныУслуг.СрезПоследних(&Дата) КАК ЦеныУслуг";
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПоследниеЦены = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		ПоследниеЦены.Вставить(Выборка.Услуга, Выборка.Услуга);
	КонецЦикла;
	
	Возврат ПоследниеЦены;
КонецФункции 

Процедура ПроверкаЦенУслуг(СписокУслуг, Отказ, ПоследниеЦеныУслуг)
	Для Каждого Запись Из СписокУслуг Цикл
		Если ПоследниеЦеныУслуг.Получить(Запись.Услуга.Ссылка) = Неопределено
			ИЛИ НЕ ЗначениеЗаполнено(Запись.Цена) Тогда
			Сообщить("Ошибка проведения. Убедитесь, что для всех услуг есть запись в регистре сведений. " + 
			"Если вы уверены, что запись есть, попробуйте заново выбрать услугу.");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьПоследниеЦеныЗапчастей()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ЦеныЗапчастей.Запчасть.Ссылка КАК Запчасть
	|ИЗ РегистрСведений.ЦеныЗапчастей.СрезПоследних(&Дата) КАК ЦеныЗапчастей";
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПоследниеЦены = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		ПоследниеЦены.Вставить(Выборка.Запчасть, Выборка.Запчасть);
	КонецЦикла;
	
	Возврат ПоследниеЦены;
КонецФункции 

Процедура ПроверкаЦенЗапчастей(СписокЗапчастей, Отказ, ПоследниеЦеныЗапчастей)
	Для Каждого Запись Из СписокЗапчастей Цикл
		Если ПоследниеЦеныЗапчастей.Получить(Запись.Запчасть.Ссылка) = Неопределено
			ИЛИ НЕ ЗначениеЗаполнено(Запись.Цена) Тогда
			Сообщить("Ошибка проведения. Убедитесь, что для всех запччастей есть запись в регистре сведений. " + 
			"Если вы уверены, что запись есть, попробуйте заново выбрать запчасть.");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьКоличествоЗапчастей()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ОстаткиЗапчастей.КоличествоОстаток КАК Количество,
	|	ОстаткиЗапчастей.Запчасть.Ссылка КАК Запчасть
	|ИЗ РегистрНакопления.ОстаткиЗапчастей.Остатки(&Дата) КАК ОстаткиЗапчастей";
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Количество = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Количество.Вставить(Выборка.Запчасть, Выборка.Количество);
	КонецЦикла;
	
	Возврат Количество;
КонецФункции

Процедура ПроверкаКоличестваЗапчастей(СписокЗапчастей, Отказ, КоличествоЗапчастей)
	Для Каждого Запись Из СписокЗапчастей Цикл
		КоличествоЗапчасти = КоличествоЗапчастей.Получить(Запись.Запчасть.Ссылка);
		Если КоличествоЗапчасти = Неопределено
			ИЛИ НЕ ЗначениеЗаполнено(Запись.Цена)
			ИЛИ КоличествоЗапчасти < Запись.Количество Тогда
			Сообщить("Ошибка проведения. Убедитесь, запчастей на складе достаточно. " + 
			"Если вы уверены, что запчастей достаточно, попробуйте заново выбрать запчасть.");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
