
Процедура ПриЗаписи(Отказ)    
	Email = СокрП(СокрЛП(Email));
	ПроверкаКорректностиНомераТелефона(Отказ);  
	Валидация.ПроверкаКорректностиПочты(Отказ, Email); 
	Валидация.ПроверкаУникальностиПочты(Отказ, Email, Справочники.Клиенты, Ссылка);
	ПроверкаУникальностиНомераТелефона(Отказ);
КонецПроцедуры

Процедура ПроверкаКорректностиНомераТелефона(Отказ)
	Если СтрДлина(СтрЗаменить(Телефон, " ", "")) < 16 Тогда
		Сообщить("В номере телефона должно быть 10 цифр (помимо начальной 7)");
		Отказ = Истина;
	КонецЕсли;           
КонецПроцедуры  

Процедура ПроверкаУникальностиНомераТелефона(Отказ)	
	Если НЕ УникальностьПолейСправочников.ПолеУникально("Клиенты", "Телефон", Телефон, Ссылка) Тогда
		Сообщить("Клиент с таким номером телефона уже существует");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры;
