
&НаКлиенте
Процедура СписокЗапчастейЗапчастьПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокЗапчастей.ТекущиеДанные;
	ПоследняяЦена = ПолучитьПоследнююЦенуЗапчасти(ТекущаяСтрока.Запчасть);
	Если ПоследняяЦена > 0 Тогда
		ТекущаяСтрока.Цена = ПоследняяЦена;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Количество) Тогда
			РассчётСуммы();
		КонецЕсли;
	Иначе
		Сообщить("Не удалось найти запись в регистре цен для этой запчасти. Проведение будет невозможно.");
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ПолучитьПоследнююЦенуЗапчасти(Запчасть)
	Отбор = Новый Структура("Запчасть", Запчасть);
	ПоследняяЗапись = РегистрыСведений.ЦеныЗапчастей.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	
	Если ПоследняяЗапись = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат ПоследняяЗапись.ЗакупочнаяЦена;
КонецФункции

&НаКлиенте
Процедура СписокЗапчастейКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокЗапчастей.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.Цена) Тогда
		РассчётСуммы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчётСуммы()
	ТекущаяСтрока = Элементы.СписокЗапчастей.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры
