Процедура ПередЗаписьюЗаявкиПередЗаписью(Источник, Отказ) Экспорт
	Если Источник.ЭтоНовый() Тогда
		Источник.ДополнительныеСвойства.Вставить("НовыйОбъект", Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписиЗаявкиПриЗаписи(Источник, Отказ) Экспорт
	Если Источник.ДополнительныеСвойства.Свойство("НовыйОбъект") Тогда
		НаборЗаписей = РегистрыСведений.СтатусыЗаявок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заявка.Установить(Источник.Ссылка);
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
		
		Запись = НаборЗаписей.Добавить();
		Запись.Заявка = Источник.Ссылка;
		Запись.Статус = Перечисления.СтатусыЗаявок.Новая;
		Запись.Период = ТекущаяДата();
		
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры
